wujc106/gd32g553r/Firmware/GD32G5x3_standard_peripheral/Include/gd32g5x3_usart.h
/*!
    \file    gd32g5x3_usart.h
    \brief   definitions for the USART

    \version 2026-02-04, V1.5.0, firmware for GD32G5x3
*/

/*
    Copyright (c) 2026, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification, 
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this 
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, 
       this list of conditions and the following disclaimer in the documentation 
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors 
       may be used to endorse or promote products derived from this software without 
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" 
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED 
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. 
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, 
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT 
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR 
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, 
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) 
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY 
OF SUCH DAMAGE.
*/

#ifndef GD32G5X3_USART_H
#define GD32G5X3_USART_H

#include "gd32g5x3.h"

/* USARTx(x=0,1,2), UARTx(x=3,4) definitions */
#define USART0                        (USART_BASE + 0x0000F400U)
#define USART1                        USART_BASE
#define USART2                        (USART_BASE + 0x00000400U)
#define UART3                         (USART_BASE + 0x00000800U) 
#define UART4                         (USART_BASE + 0x00000C00U) 

/* registers definitions */
#define USART_CTL0(usartx)            REG32((usartx) + 0x00000000U)        /*!< USART control register 0 */
#define USART_CTL1(usartx)            REG32((usartx) + 0x00000004U)        /*!< USART control register 1 */
#define USART_CTL2(usartx)            REG32((usartx) + 0x00000008U)        /*!< USART control register 2 */
#define USART_BAUD(usartx)            REG32((usartx) + 0x0000000CU)        /*!< USART baud rate register */
#define USART_GP(usartx)              REG32((usartx) + 0x00000010U)        /*!< USART guard time and prescaler register */
#define USART_RT(usartx)              REG32((usartx) + 0x00000014U)        /*!< USART receiver timeout register */
#define USART_CMD(usartx)             REG32((usartx) + 0x00000018U)        /*!< USART command register */
#define USART_STAT(usartx)            REG32((usartx) + 0x0000001CU)        /*!< USART status register */
#define USART_INTC(usartx)            REG32((usartx) + 0x00000020U)        /*!< USART status clear register */
#define USART_RDATA(usartx)           REG32((usartx) + 0x00000024U)        /*!< USART receive data register */
#define USART_TDATA(usartx)           REG32((usartx) + 0x00000028U)        /*!< USART transmit data register */
#define USART_CHC(usartx)             REG32((usartx) + 0x000000C0U)        /*!< USART coherence control register */
#define USART_FCS(usartx)             REG32((usartx) + 0x000000D0U)        /*!< USART FIFO control and status register */

/* bits definitions */
/* USARTx_CTL0 */
#define USART_CTL0_UEN                BIT(0)                                /*!< USART enable */
#define USART_CTL0_UESM               BIT(1)                                /*!< USART enable in deep-sleep mode */
#define USART_CTL0_REN                BIT(2)                                /*!< receiver enable */
#define USART_CTL0_TEN                BIT(3)                                /*!< transmitter enable */
#define USART_CTL0_IDLEIE             BIT(4)                                /*!< idle line detected interrupt enable */
#define USART_CTL0_RBNEIE             BIT(5)                                /*!< read data buffer not empty interrupt and overrun error interrupt enable */
#define USART_CTL0_TCIE               BIT(6)                                /*!< transmission complete interrupt enable */
#define USART_CTL0_TBEIE              BIT(7)                                /*!< transmitter register empty interrupt enable */
#define USART_CTL0_PERRIE             BIT(8)                                /*!< parity error interrupt enable */
#define USART_CTL0_PM                 BIT(9)                                /*!< parity mode */
#define USART_CTL0_PCEN               BIT(10)                               /*!< parity control enable */
#define USART_CTL0_WM                 BIT(11)                               /*!< wakeup method in mute mode */
#define USART_CTL0_WL0                BIT(12)                               /*!< word length */
#define USART_CTL0_MEN                BIT(13)                               /*!< mute mode enable */
#define USART_CTL0_AMIE0              BIT(14)                               /*!< address 0 match interrupt enable */
#define USART_CTL0_OVSMOD             BIT(15)                               /*!< oversample mode */
#define USART_CTL0_DED                BITS(16,20)                           /*!< driver enable deassertion time */
#define USART_CTL0_DEA                BITS(21,25)                           /*!< driver enable assertion time */
#define USART_CTL0_RTIE               BIT(26)                               /*!< receiver timeout interrupt enable */
#define USART_CTL0_EBIE               BIT(27)                               /*!< end of block interrupt enable */
#define USART_CTL0_WL1                BIT(28)                               /*!< word length */
#define USART_CTL0_AMIE1              BIT(31)                               /*!< address 1 match interrupt enable */

/* USARTx_CTL1 */
#define USART_CTL1_AMEN0              BIT(0)                                /*!< address match mode enable 0 */
#define USART_CTL1_ADDM0              BIT(4)                                /*!< address detection mode 0 */
#define USART_CTL1_LBLEN              BIT(5)                                /*!< LIN break frame length */
#define USART_CTL1_LBDIE              BIT(6)                                /*!< LIN break detection interrupt enable */
#define USART_CTL1_CLEN               BIT(8)                                /*!< last bit clock pulse */
#define USART_CTL1_CPH                BIT(9)                                /*!< clock phase */
#define USART_CTL1_CPL                BIT(10)                               /*!< clock polarity */
#define USART_CTL1_CKEN               BIT(11)                               /*!< ck pin enable */
#define USART_CTL1_STB                BITS(12,13)                           /*!< stop bits length */
#define USART_CTL1_LMEN               BIT(14)                               /*!< LIN mode enable */
#define USART_CTL1_STRP               BIT(15)                               /*!< swap TX/RX pins */
#define USART_CTL1_RINV               BIT(16)                               /*!< RX pin level inversion */
#define USART_CTL1_TINV               BIT(17)                               /*!< TX pin level inversion */
#define USART_CTL1_DINV               BIT(18)                               /*!< data bit level inversion */
#define USART_CTL1_MSBF               BIT(19)                               /*!< most significant bit first */
#define USART_CTL1_RTEN               BIT(23)                               /*!< receiver timeout enable */
#define USART_CTL1_ADDR0              BITS(24,31)                           /*!< address 0 of the USART terminal */
         
/* USARTx_CTL2 */         
#define USART_CTL2_ERRIE              BIT(0)                                /*!< error interrupt enable in multibuffer communication */
#define USART_CTL2_IREN               BIT(1)                                /*!< IrDA mode enable */
#define USART_CTL2_IRLP               BIT(2)                                /*!< IrDA low-power */
#define USART_CTL2_HDEN               BIT(3)                                /*!< half-duplex enable */
#define USART_CTL2_NKEN               BIT(4)                                /*!< NACK enable in smartcard mode */
#define USART_CTL2_SCEN               BIT(5)                                /*!< smartcard mode enable */
#define USART_CTL2_DENR               BIT(6)                                /*!< DMA enable for reception */
#define USART_CTL2_DENT               BIT(7)                                /*!< DMA enable for transmission */
#define USART_CTL2_RTSEN              BIT(8)                                /*!< RTS enable */
#define USART_CTL2_CTSEN              BIT(9)                                /*!< CTS enable */
#define USART_CTL2_CTSIE              BIT(10)                               /*!< CTS interrupt enable */
#define USART_CTL2_OSB                BIT(11)                               /*!< one sample bit mode */
#define USART_CTL2_OVRD               BIT(12)                               /*!< overrun disable */
#define USART_CTL2_DDRE               BIT(13)                               /*!< disable DMA on reception error */
#define USART_CTL2_DEM                BIT(14)                               /*!< driver enable mode */
#define USART_CTL2_DEP                BIT(15)                               /*!< driver enable polarity mode */
#define USART_CTL2_AMEN1              BIT(16)                               /*!< address match mode enable 1 */
#define USART_CTL2_SCRTNUM            BITS(17,19)                           /*!< smartcard auto-retry number */
#define USART_CTL2_WUM                BITS(20,21)                           /*!< wakeup mode from deep-sleep mode */
#define USART_CTL2_WUIE               BIT(22)                               /*!< wakeup from deep-sleep mode interrupt enable */
#define USART_CTL2_ADDM1              BIT(23)                               /*!< address detection mode 1 */
#define USART_CTL2_ADDR1              BITS(24,31)                           /*!< address 1 of the USART terminal */

